blog-posts/2007-02-19-emacs-15-times-multiplication-table.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs: 15 times multiplication table</title>
<!-- 2015-10-19 Mon 14:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs: 15 times multiplication table</h1>
<p>
February 19th, 2007 -
<a href="http://sachachua.com/blog/p/4217"><a href="http://sachachua.com/blog/p/4217">http://sachachua.com/blog/p/4217</a></a>
</p>

<p>
Wayne will get a kick out of the fact that I wrote a function to help
 me set up Emacs to do a little of what his Nintendo DS does&#x2026;
</p>

<p>
(Just you wait until I get speech recognition, sir!)
</p>

<pre class="example">
;; Create a flashcard-type file for the multiplication table until 15
(insert
 (mapconcat
  'identity
  (shuffle-vector
   (apply
    'vector
    (apply
     'append
     (let ((list '(1 2 3 4 5 6 7 8 9 10 11 12 13 14 15)))
       (mapcar
        (lambda (a)
          (mapcar
           (lambda (b)
             (format "%d x %d = : %d" a b (* a b)))
           list))
        list)))))
  "\n"))
</pre>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>
</p>

<p>
Random Emacs symbol: mm-insert-part &#x2013; Function: Insert the contents of
HANDLE in the current buffer.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
